PKS1C/src/Documents/РеализацияЛицензий/РеализацияЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияЛицензий</name>
  <basedOn>Document.ПоступлениеЛицензий</basedOn>
  <registerRecords>AccumulationRegister.Лицензии</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеЛицензий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАктивации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПривязанККлючу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

PKS1C/src/AccumulationRegisters/Лицензии/Лицензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лицензии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодАктивации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

PKS1C/src/Documents/РеализацияЛицензий/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//Проверка на дубли строк
	Для Каждого СтрокаТЗ Из Товары Цикл
		Для Индекс = Товары.Индекс(СтрокаТЗ) + 1 ПО Товары.Количество() - 1 Цикл
			Строка = Товары.Получить(Индекс);
			Если СтрокаТЗ.Номенклатура = Строка.Номенклатура
			   И СтрокаТЗ.КодАктивации = Строка.КодАктивации
			   И СтрокаТЗ.РегистрационныйНомер = Строка.РегистрационныйНомер
			   И СтрокаТЗ.Серия = Строка.Серия Тогда
			   Сообщить("Обнаружены повторяющиеся строки (" + СтрокаТЗ.НомерСтроки + ", " + Строка.НомерСтроки + "). Документ не может быть проведен.");
			   Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Проверка лицензии на остатках
	ЕстьОстатки = Истина;
	СтрогийУчетЛицензий = Константы.СтрогийУчетЛицензий.Получить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Остатки = РегистрыНакопления.Лицензии.Остатки(ЭтотОбъект.МоментВремени(),Новый Структура(
																			"Номенклатура,Серия,,Номер,КодАктивации",
																			ТекСтрокаТовары.Номенклатура,
																			ТекСтрокаТовары.Серия,
																			ТекСтрокаТовары.РегистрационныйНомер,
																			ТекСтрокаТовары.КодАктивации
																			));
		Если Остатки.Количество() = 1 Тогда
			Если Остатки[0].Количество < 1 Тогда
				ЕстьОстатки = Ложь;
				Отказ = СтрогийУчетЛицензий;
			КонецЕсли;
		Иначе
			ЕстьОстатки = Ложь;
			Отказ = СтрогийУчетЛицензий;
		КонецЕсли;	
	КонецЦикла;
	
	Если Не Отказ Тогда

		// регистр Лицензии Расход
		Движения.Лицензии.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.Лицензии.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Номер = ТекСтрокаТовары.РегистрационныйНомер;
			Движение.КодАктивации = ТекСтрокаТовары.КодАктивации;
			Движение.Серия = ТекСтрокаТовары.Серия;
			Движение.Количество = 1;
		КонецЦикла;
	Иначе
		Если НЕ ЕстьОстатки Тогда
			Сообщить("Есть позиции с отсутствующими лицензиями на остатках");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.АвторизованныйПользователь();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеЛицензий") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрокаТовары);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЭтотОбъект.ЭтоНовый() Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;
	Для Каждого Товар Из Товары Цикл
		Товар.КодАктивации = УдалитьПробельныеСимволы(Товар.КодАктивации);
		Товар.Серия = УдалитьПробельныеСимволы(Товар.Серия);
		Товар.РегистрационныйНомер = УдалитьПробельныеСимволы(Товар.РегистрационныйНомер);
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Фиксация в истории изменений
	АутсорсФункцииДокументовСервер.УстановитьИзменениеДокумента(ЭтотОбъект.Ссылка);
КонецПроцедуры
